---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.SecondaryEngagementParameterError
source: html/2cdc39c6-5ea0-a176-4d98-b62ba650febe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.SecondaryEngagementParameterError Property

This is used to post error. "Bar Engagement 2" has an incorrect value.

## Syntax (C#)
```csharp
public static FailureDefinitionId SecondaryEngagementParameterError { get; }
```